; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 - counter
	)
  (:init
		(= (value c0) 97)
	(= (value c1) 53)
	(= (value c2) 31)
	(= (value c3) 9)
	(= (value c4) 70)
	(= (value c5) 37)
	(= (value c6) 63)
	(= (value c7) 27)
	(= (value c8) 2)
	(= (value c9) 87)
	(= (value c10) 50)
	(= (value c11) 95)
	(= (value c12) 79)
	(= (value c13) 62)
	(= (value c14) 40)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
		)
	)
)

; plan
1. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 4 of 14
2. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 4 of 14
3. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 4 of 14
4. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 4 of 14
5. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 14
6. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 14
7. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 14
8. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 14
9. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 14
10. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 4 of 14
11. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 4 of 14
12. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 4 of 14
13. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 4 of 14
14. (increment c14)
   changed: (value c14) from 40 to 44
   goals met: 4 of 14
15. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 4 of 14
16. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 4 of 14
17. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 4 of 14
18. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 4 of 14
19. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 4 of 14
20. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 4 of 14
21. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 4 of 14
22. (increment c8)
   changed: (value c8) from 2 to 6
   goals met: 4 of 14
23. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 4 of 14
24. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 4 of 14
25. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 4 of 14
26. (increment c8)
   changed: (value c8) from 6 to 10
   goals met: 4 of 14
27. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 4 of 14
28. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 4 of 14
29. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 14
30. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 14
31. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 4 of 14
32. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 4 of 14
33. (increment c3)
   changed: (value c3) from 9 to 13
   goals met: 4 of 14
34. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 14
35. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 14
36. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 14
37. (increment c3)
   changed: (value c3) from 13 to 17
   goals met: 4 of 14
38. (increment c8)
   changed: (value c8) from 10 to 14
   goals met: 4 of 14
39. (increment c8)
   changed: (value c8) from 14 to 18
   goals met: 4 of 14
40. (increment c7)
   changed: (value c7) from 27 to 33
   goals met: 4 of 14
41. (increment c7)
   changed: (value c7) from 33 to 39
   goals met: 4 of 14
42. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 14
43. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 14
44. (increment c3)
   changed: (value c3) from 17 to 21
   goals met: 4 of 14
45. (increment c3)
   changed: (value c3) from 21 to 25
   goals met: 4 of 14
46. (increment c3)
   changed: (value c3) from 25 to 29
   goals met: 4 of 14
47. (increment c3)
   changed: (value c3) from 29 to 33
   goals met: 5 of 14
48. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 5 of 14
49. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 5 of 14
50. (increment c14)
   changed: (value c14) from 44 to 50
   goals met: 5 of 14
51. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 5 of 14
52. (increment c14)
   changed: (value c14) from 50 to 57
   goals met: 5 of 14
53. (increment c14)
   changed: (value c14) from 57 to 64
   goals met: 6 of 14
54. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 6 of 14
55. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 6 of 14
56. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 6 of 14
57. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 6 of 14
58. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 6 of 14
59. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 6 of 14
60. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 6 of 14
61. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 6 of 14
62. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 6 of 14
63. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 6 of 14
64. (increment c12)
   changed: (value c12) from 79 to 84
   goals met: 6 of 14
65. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 6 of 14
66. (increment c13)
   changed: (value c13) from 62 to 68
   goals met: 5 of 14
67. (increment c13)
   changed: (value c13) from 68 to 74
   goals met: 5 of 14
68. (increment c14)
   changed: (value c14) from 64 to 71
   goals met: 5 of 14
69. (increment c14)
   changed: (value c14) from 71 to 78
   goals met: 6 of 14
70. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 6 of 14
71. (increment c13)
   changed: (value c13) from 74 to 80
   goals met: 5 of 14
72. (increment c12)
   changed: (value c12) from 84 to 90
   goals met: 5 of 14
73. (increment c14)
   changed: (value c14) from 78 to 85
   goals met: 6 of 14
74. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 6 of 14
75. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 6 of 14
76. (increment c10)
   changed: (value c10) from 50 to 58
   goals met: 6 of 14
77. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 6 of 14
78. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 6 of 14
79. (increment c10)
   changed: (value c10) from 58 to 66
   goals met: 6 of 14
80. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 6 of 14
81. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 6 of 14
82. (increment c10)
   changed: (value c10) from 66 to 76
   goals met: 6 of 14
83. (increment c10)
   changed: (value c10) from 76 to 86
   goals met: 6 of 14
84. (decrement c9)
   changed: (value c9) from 87 to 85
   goals met: 7 of 14
85. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 7 of 14
86. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 14
87. (decrement c6)
   changed: (value c6) from 63 to 60
   goals met: 7 of 14
88. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 14
89. (increment c8)
   changed: (value c8) from 18 to 23
   goals met: 7 of 14
90. (increment c8)
   changed: (value c8) from 23 to 28
   goals met: 7 of 14
91. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 7 of 14
92. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 7 of 14
93. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 7 of 14
94. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 14
95. (decrement c6)
   changed: (value c6) from 60 to 56
   goals met: 7 of 14
96. (decrement c6)
   changed: (value c6) from 56 to 52
   goals met: 7 of 14
97. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 14
98. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 7 of 14
99. (increment c5)
   changed: (value c5) from 37 to 44
   goals met: 7 of 14
100. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 14
101. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 14
102. (increment c5)
   changed: (value c5) from 44 to 51
   goals met: 7 of 14
103. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 14
104. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 7 of 14
105. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 14
106. (increment c5)
   changed: (value c5) from 51 to 61
   goals met: 6 of 14
107. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 6 of 14
108. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 6 of 14
109. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 6 of 14
110. (increment c13)
   changed: (value c13) from 80 to 86
   goals met: 5 of 14
111. (increment c14)
   changed: (value c14) from 85 to 92
   goals met: 6 of 14
112. (increment c12)
   changed: (value c12) from 90 to 96
   goals met: 7 of 14
113. (increment c13)
   changed: (value c13) from 86 to 92
   goals met: 6 of 14
114. (increment c14)
   changed: (value c14) from 92 to 99
   goals met: 7 of 14
115. (increment c13)
   changed: (value c13) from 92 to 98
   goals met: 8 of 14
116. (increment c8)
   changed: (value c8) from 28 to 33
   goals met: 8 of 14
117. (increment c8)
   changed: (value c8) from 33 to 38
   goals met: 8 of 14
118. (increment c8)
   changed: (value c8) from 38 to 43
   goals met: 9 of 14
119. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 9 of 14
120. (increment c2)
   changed: (value c2) from 31 to 38
   goals met: 8 of 14
121. (increment c3)
   changed: (value c3) from 33 to 37
   goals met: 8 of 14
122. (increment c3)
   changed: (value c3) from 37 to 41
   goals met: 9 of 14
123. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 9 of 14
124. (increment c2)
   changed: (value c2) from 38 to 46
   goals met: 8 of 14
125. (increment c3)
   changed: (value c3) from 41 to 45
   goals met: 8 of 14
126. (increment c3)
   changed: (value c3) from 45 to 49
   goals met: 9 of 14
127. (increment c2)
   changed: (value c2) from 46 to 54
   goals met: 9 of 14
128. (increment c3)
   changed: (value c3) from 49 to 53
   goals met: 9 of 14
129. (increment c3)
   changed: (value c3) from 53 to 57
   goals met: 10 of 14
130. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 10 of 14
131. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 10 of 14
132. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 10 of 14
133. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 10 of 14
134. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 10 of 14
135. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 10 of 14
136. (increment c1)
   changed: (value c1) from 53 to 59
   goals met: 9 of 14
137. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 9 of 14
138. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 9 of 14
139. (increment c1)
   changed: (value c1) from 59 to 67
   goals met: 9 of 14
140. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 9 of 14
141. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 9 of 14
142. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 9 of 14
143. (increment c1)
   changed: (value c1) from 67 to 76
   goals met: 9 of 14
144. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 9 of 14
145. (increment c2)
   changed: (value c2) from 54 to 62
   goals met: 8 of 14
146. (increment c3)
   changed: (value c3) from 57 to 61
   goals met: 8 of 14
147. (increment c3)
   changed: (value c3) from 61 to 65
   goals met: 9 of 14
148. (increment c2)
   changed: (value c2) from 62 to 70
   goals met: 8 of 14
149. (increment c1)
   changed: (value c1) from 76 to 86
   goals met: 8 of 14
150. (increment c1)
   changed: (value c1) from 86 to 96
   goals met: 8 of 14
151. (decrement c2)
   changed: (value c2) from 70 to 62
   goals met: 9 of 14
152. (decrement c0)
   changed: (value c0) from 97 to 95
   goals met: 10 of 14
153. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 10 of 14
154. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 10 of 14
155. (increment c7)
   changed: (value c7) from 39 to 49
   goals met: 9 of 14
156. (increment c8)
   changed: (value c8) from 43 to 48
   goals met: 9 of 14
157. (increment c8)
   changed: (value c8) from 48 to 53
   goals met: 10 of 14
158. (increment c7)
   changed: (value c7) from 49 to 59
   goals met: 10 of 14
159. (increment c8)
   changed: (value c8) from 53 to 58
   goals met: 10 of 14
160. (increment c8)
   changed: (value c8) from 58 to 63
   goals met: 11 of 14
161. (increment c5)
   changed: (value c5) from 61 to 71
   goals met: 12 of 14
162. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 12 of 14
163. (increment c6)
   changed: (value c6) from 52 to 57
   goals met: 12 of 14
164. (increment c6)
   changed: (value c6) from 57 to 62
   goals met: 11 of 14
165. (increment c7)
   changed: (value c7) from 59 to 69
   goals met: 11 of 14
166. (increment c8)
   changed: (value c8) from 63 to 68
   goals met: 11 of 14
167. (increment c8)
   changed: (value c8) from 68 to 73
   goals met: 12 of 14
168. (increment c6)
   changed: (value c6) from 62 to 67
   goals met: 12 of 14
169. (increment c6)
   changed: (value c6) from 67 to 72
   goals met: 12 of 14
170. (increment c7)
   changed: (value c7) from 69 to 79
   goals met: 12 of 14
171. (increment c8)
   changed: (value c8) from 73 to 78
   goals met: 12 of 14
172. (increment c8)
   changed: (value c8) from 78 to 83
   goals met: 13 of 14
173. (decrement c1)
   changed: (value c1) from 96 to 86
   goals met: 12 of 14
174. (decrement c1)
   changed: (value c1) from 86 to 76
   goals met: 12 of 14
175. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 12 of 14
176. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 12 of 14
177. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 12 of 14
178. (decrement c0)
   changed: (value c0) from 95 to 90
   goals met: 12 of 14
179. (decrement c0)
   changed: (value c0) from 90 to 85
   goals met: 12 of 14
180. (decrement c0)
   changed: (value c0) from 85 to 80
   goals met: 12 of 14
181. (decrement c0)
   changed: (value c0) from 80 to 75
   goals met: 13 of 14
182. (decrement c1)
   changed: (value c1) from 76 to 66
   goals met: 12 of 14
183. (decrement c1)
   changed: (value c1) from 66 to 56
   goals met: 13 of 14
184. (decrement c0)
   changed: (value c0) from 75 to 70
   goals met: 13 of 14
185. (decrement c0)
   changed: (value c0) from 70 to 65
   goals met: 13 of 14
186. (decrement c0)
   changed: (value c0) from 65 to 60
   goals met: 13 of 14
187. (decrement c0)
   changed: (value c0) from 60 to 55
   goals met: 14 of 14
